import React, { useState, useEffect, useContext } from 'react';
import { Context } from '../index'
import { useNavigate } from 'react-router-dom';
import '../styles/Header.css'
import { Squash as Hamburger } from 'hamburger-react';
import { ServiceADMIN_ROUTE, CourseADMIN_ROUTE, RequestADMIN_ROUTE, SERVICES_ROUTE, LICENSES_ROUTE, ADMIN_ROUTE, PAGE404_ROUTE, COURSES_ROUTE, MAINPAGE_ROUTE, REQUEST_ROUTE, LOGIN_ROUTE, CONTACT_ROUTE } from '../utils/consts';
import ButtonBordered from './UI/button/ButtonBordered';
import Button from './UI/button/Button';
import { Link } from "react-router-dom";
import { observer } from 'mobx-react-lite';

const Header = observer((props) => {
    const { user } = useContext(Context)
    const navigate = useNavigate()
    const [position, setPosition] = useState(window.pageYOffset)
    const [visible, setVisible] = useState(true)
    useEffect(() => {
        const handleScroll = () => {
            let moving = window.pageYOffset

            setVisible(position > moving);
            setPosition(moving)
        };
        window.addEventListener("scroll", handleScroll);
        return (() => {
            window.removeEventListener("scroll", handleScroll);
        })
    })

    const cls = visible ? "visible" : "hidden";

    const logOut = () => {
        user.setUser({})
        user.setIsAuth(false)
        localStorage.removeItem('token')
        navigate(MAINPAGE_ROUTE)
    }

    const [isOpen, setOpen] = useState(false)

    const close = () => {
        setOpen(false)
    }

    const navigation = [
        { route: SERVICES_ROUTE, text: 'Услуги' },
        { route: COURSES_ROUTE, text: 'Курсы' },
        { route: CONTACT_ROUTE, text: 'Контакты' },
        { route: LICENSES_ROUTE, text: 'Лицензии' },
    ];

    const adminNav = [
        { route: ServiceADMIN_ROUTE, text: 'Услуги' },
        { route: CourseADMIN_ROUTE, text: 'Курсы' },
        { route: RequestADMIN_ROUTE, text: 'Заявки' },
        { route: ADMIN_ROUTE + '/license', text: 'Документы' },
    ];

    return (
        <header className={cls}>
            {user.isAuth ?
                <div className="container">
                    <Link className="logo">
                        <svg viewBox="0 0 98 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M14.568 3.56C14.88 3.56 15.12 3.8 15.12 4.112V13.088C15.12 13.4 14.88 13.64 14.568 13.64H5.592C5.28 13.64 5.04 13.4 5.04 13.088V4.112C5.04 3.8 5.28 3.56 5.592 3.56H14.568ZM1.68 13.088C1.68 13.4 1.44 13.64 1.128 13.64H0.552C0.24 13.64 0 13.88 0 14.192V16.448C0 16.76 0.24 17 0.552 17H19.608C19.92 17 20.16 16.76 20.16 16.448V14.192C20.16 13.88 19.92 13.64 19.608 13.64H19.032C18.72 13.64 18.48 13.4 18.48 13.088V3.56C18.48 1.712 16.968 0.199999 15.12 0.199999H5.04C3.192 0.199999 1.68 1.712 1.68 3.56V13.088ZM25.737 13.64C25.425 13.64 25.185 13.4 25.185 13.088V10.832C25.185 10.52 25.425 10.28 25.737 10.28H34.713C35.025 10.28 35.265 10.52 35.265 10.832V13.088C35.265 13.4 35.025 13.64 34.713 13.64H25.737ZM25.737 6.92C25.425 6.92 25.185 6.68 25.185 6.368V4.112C25.185 3.8 25.425 3.56 25.737 3.56H34.713C35.025 3.56 35.265 3.8 35.265 4.112V6.368C35.265 6.68 35.025 6.92 34.713 6.92H25.737ZM21.825 13.64C21.825 15.488 23.337 17 25.185 17H35.265C37.113 17 38.625 15.488 38.625 13.64V11.48C38.625 10.712 38.313 9.968 37.785 9.44L36.945 8.6L37.785 7.76C38.313 7.232 38.625 6.488 38.625 5.72V3.56C38.625 1.712 37.113 0.199999 35.265 0.199999H25.185C23.337 0.199999 21.825 1.712 21.825 3.56V13.64ZM41.0438 0.751999V6.92C41.0438 8.768 42.5558 10.28 44.4038 10.28H53.9318C54.2438 10.28 54.4838 10.52 54.4838 10.832V13.088C54.4838 13.4 54.2438 13.64 53.9318 13.64H43.2758C42.9638 13.64 42.7238 13.88 42.7238 14.192V16.448C42.7238 16.76 42.9638 17 43.2758 17H54.4838C56.3318 17 57.8438 15.488 57.8438 13.64V0.751999C57.8438 0.439999 57.6038 0.199999 57.2918 0.199999H55.0358C54.7238 0.199999 54.4838 0.439999 54.4838 0.751999V6.368C54.4838 6.68 54.2438 6.92 53.9318 6.92H44.9558C44.6438 6.92 44.4038 6.68 44.4038 6.368V0.751999C44.4038 0.439999 44.1638 0.199999 43.8518 0.199999H41.5958C41.2838 0.199999 41.0438 0.439999 41.0438 0.751999ZM60.2391 16.424C60.2391 16.736 60.4791 16.976 60.7911 16.976H63.0471C63.3591 16.976 63.5991 16.736 63.5991 16.424V10.808C63.5991 10.496 63.8391 10.256 64.1511 10.256H73.1271C73.4391 10.256 73.6791 10.496 73.6791 10.808V16.424C73.6791 16.736 73.9191 16.976 74.2311 16.976H76.4871C76.7991 16.976 77.0391 16.736 77.0391 16.424V0.727999C77.0391 0.415999 76.7991 0.175999 76.4871 0.175999H74.2311C73.9191 0.175999 73.6791 0.415999 73.6791 0.727999V6.344C73.6791 6.656 73.4391 6.896 73.1271 6.896H64.1511C63.8391 6.896 63.5991 6.656 63.5991 6.344V0.727999C63.5991 0.415999 63.3591 0.175999 63.0471 0.175999H60.7911C60.4791 0.175999 60.2391 0.415999 60.2391 0.727999V16.424ZM79.4578 0.751999V13.64C79.4578 15.488 80.9698 17 82.8178 17H97.3858C97.6978 17 97.9378 16.76 97.9378 16.448V14.192C97.9378 13.88 97.6978 13.64 97.3858 13.64H96.8098C96.4978 13.64 96.2578 13.4 96.2578 13.088V0.751999C96.2578 0.439999 96.0178 0.199999 95.7058 0.199999H93.4498C93.1378 0.199999 92.8978 0.439999 92.8978 0.751999V13.088C92.8978 13.4 92.6578 13.64 92.3458 13.64H83.3698C83.0578 13.64 82.8178 13.4 82.8178 13.088V0.751999C82.8178 0.439999 82.5778 0.199999 82.2658 0.199999H80.0098C79.6978 0.199999 79.4578 0.439999 79.4578 0.751999Z" fill="#1E1E1E" />
                        </svg>
                    </Link>
                    <nav className="headerNav headerNav--admin">
                        <ul>
                            {adminNav.map(nav => (
                                <li key={nav.text}>
                                    <Link to={nav.route} className="menu_item">
                                        {nav.text}
                                    </Link>
                                </li>
                            ))}
                            <div className="btnMyHeader">
                                <ButtonBordered onClick={() => navigate(ADMIN_ROUTE + '/settings')}>
                                    Настройки
                            </ButtonBordered>
                                <ButtonBordered onClick={() => logOut()}>
                                    Выйти
                            </ButtonBordered>
                            </div>
                        </ul>
                    </nav>
                </div>
                :
                <div className="container">
                    <Link to={MAINPAGE_ROUTE} className="logo">
                        <svg viewBox="0 0 98 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M14.568 3.56C14.88 3.56 15.12 3.8 15.12 4.112V13.088C15.12 13.4 14.88 13.64 14.568 13.64H5.592C5.28 13.64 5.04 13.4 5.04 13.088V4.112C5.04 3.8 5.28 3.56 5.592 3.56H14.568ZM1.68 13.088C1.68 13.4 1.44 13.64 1.128 13.64H0.552C0.24 13.64 0 13.88 0 14.192V16.448C0 16.76 0.24 17 0.552 17H19.608C19.92 17 20.16 16.76 20.16 16.448V14.192C20.16 13.88 19.92 13.64 19.608 13.64H19.032C18.72 13.64 18.48 13.4 18.48 13.088V3.56C18.48 1.712 16.968 0.199999 15.12 0.199999H5.04C3.192 0.199999 1.68 1.712 1.68 3.56V13.088ZM25.737 13.64C25.425 13.64 25.185 13.4 25.185 13.088V10.832C25.185 10.52 25.425 10.28 25.737 10.28H34.713C35.025 10.28 35.265 10.52 35.265 10.832V13.088C35.265 13.4 35.025 13.64 34.713 13.64H25.737ZM25.737 6.92C25.425 6.92 25.185 6.68 25.185 6.368V4.112C25.185 3.8 25.425 3.56 25.737 3.56H34.713C35.025 3.56 35.265 3.8 35.265 4.112V6.368C35.265 6.68 35.025 6.92 34.713 6.92H25.737ZM21.825 13.64C21.825 15.488 23.337 17 25.185 17H35.265C37.113 17 38.625 15.488 38.625 13.64V11.48C38.625 10.712 38.313 9.968 37.785 9.44L36.945 8.6L37.785 7.76C38.313 7.232 38.625 6.488 38.625 5.72V3.56C38.625 1.712 37.113 0.199999 35.265 0.199999H25.185C23.337 0.199999 21.825 1.712 21.825 3.56V13.64ZM41.0438 0.751999V6.92C41.0438 8.768 42.5558 10.28 44.4038 10.28H53.9318C54.2438 10.28 54.4838 10.52 54.4838 10.832V13.088C54.4838 13.4 54.2438 13.64 53.9318 13.64H43.2758C42.9638 13.64 42.7238 13.88 42.7238 14.192V16.448C42.7238 16.76 42.9638 17 43.2758 17H54.4838C56.3318 17 57.8438 15.488 57.8438 13.64V0.751999C57.8438 0.439999 57.6038 0.199999 57.2918 0.199999H55.0358C54.7238 0.199999 54.4838 0.439999 54.4838 0.751999V6.368C54.4838 6.68 54.2438 6.92 53.9318 6.92H44.9558C44.6438 6.92 44.4038 6.68 44.4038 6.368V0.751999C44.4038 0.439999 44.1638 0.199999 43.8518 0.199999H41.5958C41.2838 0.199999 41.0438 0.439999 41.0438 0.751999ZM60.2391 16.424C60.2391 16.736 60.4791 16.976 60.7911 16.976H63.0471C63.3591 16.976 63.5991 16.736 63.5991 16.424V10.808C63.5991 10.496 63.8391 10.256 64.1511 10.256H73.1271C73.4391 10.256 73.6791 10.496 73.6791 10.808V16.424C73.6791 16.736 73.9191 16.976 74.2311 16.976H76.4871C76.7991 16.976 77.0391 16.736 77.0391 16.424V0.727999C77.0391 0.415999 76.7991 0.175999 76.4871 0.175999H74.2311C73.9191 0.175999 73.6791 0.415999 73.6791 0.727999V6.344C73.6791 6.656 73.4391 6.896 73.1271 6.896H64.1511C63.8391 6.896 63.5991 6.656 63.5991 6.344V0.727999C63.5991 0.415999 63.3591 0.175999 63.0471 0.175999H60.7911C60.4791 0.175999 60.2391 0.415999 60.2391 0.727999V16.424ZM79.4578 0.751999V13.64C79.4578 15.488 80.9698 17 82.8178 17H97.3858C97.6978 17 97.9378 16.76 97.9378 16.448V14.192C97.9378 13.88 97.6978 13.64 97.3858 13.64H96.8098C96.4978 13.64 96.2578 13.4 96.2578 13.088V0.751999C96.2578 0.439999 96.0178 0.199999 95.7058 0.199999H93.4498C93.1378 0.199999 92.8978 0.439999 92.8978 0.751999V13.088C92.8978 13.4 92.6578 13.64 92.3458 13.64H83.3698C83.0578 13.64 82.8178 13.4 82.8178 13.088V0.751999C82.8178 0.439999 82.5778 0.199999 82.2658 0.199999H80.0098C79.6978 0.199999 79.4578 0.439999 79.4578 0.751999Z" fill="#1E1E1E" />
                        </svg>
                    </Link>
                    <nav className="headerNav">
                        <ul>
                            {navigation.map(nav => (
                                <li key={nav.text}>
                                    <Link to={nav.route} className="menu_item">
                                        {nav.text}
                                    </Link>
                                </li>
                            ))}
                            <div className="btnMyHeader">
                                <Button onClick={() => navigate(REQUEST_ROUTE)}>
                                    Подать заявку
                                </Button >
                                <ButtonBordered onClick={() => navigate(LOGIN_ROUTE)}>
                                    Войти
                                </ButtonBordered >
                            </div>
                        </ul>

                    </nav>
                    <nav className="headerNav headerNav__mobile">
                        <Hamburger className="hamb" size={25} color="#211E2A" toggled={isOpen} toggle={setOpen} />
                        <div className={`burgerMenu ${isOpen ? 'show' : ''}`}>
                            <div className="container">
                                <ul>
                                    {navigation.map(nav => (
                                        <li key={nav.text}>
                                            <Link to={nav.route} onClick={close} className="menu_item">
                                                {nav.text}
                                            </Link>
                                        </li>
                                    ))}
                                </ul>
                                <div className="btnMyHeader">
                                    <Button onClick={() => navigate(REQUEST_ROUTE)}>
                                        Подать заявку
                                    </Button >
                                    <ButtonBordered className="enter" onClick={() => navigate(LOGIN_ROUTE)}>
                                        Войти
                                    </ButtonBordered>
                                </div>
                            </div>
                        </div>
                    </nav>
                </div>
            }
        </header >
    );
});

export default Header;